package com.potato.study.leetcodecn.p02802.t001;


import com.potato.study.leetcode.domain.ListNode;

/**
 *
 * 2802. 找出第 K 个幸运数字
 *
 * 我们知道 4 和 7 是 幸运 数字。同时，如果一个数字只包含幸运数字，那么它被称为幸运数字。
 *
 * 给定一个整数 k，返回第 k 个幸运数字，并将其表示为一个 字符串 。
 *
 *
 *
 * 示例 1：
 *
 * 输入：k = 4
 * 输出："47"
 * 解释：第一个幸运数字是 4，第二个是 7，第三个是 44，第四个是 47。
 * 示例 2：
 *
 * 输入：k = 10
 * 输出："477"
 * 解释：按递增顺序列出的幸运数字为：
 * 4, 7, 44, 47, 74, 77, 444, 447, 474, 477。 因此第10个幸运数字是477。
 * 示例 3：
 *
 * 输入：k = 1000
 * 输出："777747447"
 * 解释：第 1000 个幸运数字是 777747447。
 *
 *
 * 提示：
 *
 * 1 <= k <= 109
 *
 */
public class Solution {



    public String kthLuckyNumber(int k) {
        // 第k个 计算一下对应的事多少个位置  010 三个位置
//        int temp = k;
//        int bitCount = 1;
//        while (temp >) {
//
//        }

        // 看看当前是第几个
        return "";
    }


}
